ka2_2024/src/InformationRegisters/ДанныеПервичныхДокументов/ДанныеПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПервичныхДокументов</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерРегистратора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ЗаписьКнигиПокупок</types>
      <types>DocumentRef.ПеремещениеВЭксплуатации</types>
      <types>DocumentRef.СправкиНДФЛДляПередачиВНалоговыйОрган</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ВводДанныхПоНалогуНаПрибыль</types>
      <types>DocumentRef.ПоступлениеУслугВПодразделение</types>
      <types>DocumentRef.ПеремещениеМатериаловВПроизводстве</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПереоценкаНМА2_4</types>
      <types>DocumentRef.ПередачаОСВАренду</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.СчетФактураПолученныйАванс</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ПоступлениеУслугПоАренде</types>
      <types>DocumentRef.ПереносРНПТМатериаловНаПродукцию</types>
      <types>DocumentRef.ИнойДокументПодтвержденияНДС</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.РегистраторРасчетов</types>
      <types>DocumentRef.НачислениеРеверсивногоНДС</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ВводОстатковВзаиморасчетовПоАренде</types>
      <types>DocumentRef.ПодготовкаКПередачеНМА2_4</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.АмортизацияНМА</types>
      <types>DocumentRef.ВнесениеДенежныхСредствВКассуККМ</types>
      <types>DocumentRef.РасчетКурсовыхРазниц</types>
      <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеОС2_4</types>
      <types>DocumentRef.ОтгрузкаТоваровСХранения</types>
      <types>DocumentRef.ИзменениеПараметровОС2_4</types>
      <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</types>
      <types>DocumentRef.РаспределениеДоходовПоНаправлениямДеятельности</types>
      <types>DocumentRef.ВводОстатковДенежныхСредств</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
      <types>DocumentRef.АктПремииКлиенту</types>
      <types>DocumentRef.ВозвратОСИзАренды2_4</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.ОбесценениеВНА</types>
      <types>DocumentRef.АктВыполненныхВнутреннихРабот</types>
      <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ОбъединениеОС</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.СчетФактураВыданныйАванс</types>
      <types>DocumentRef.МаркировкаТоваровГИСМ</types>
      <types>DocumentRef.КорректировкаНалогообложенияНДСПартийТоваров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.СводнаяСправкаНДС</types>
      <types>DocumentRef.ИзменениеУсловийПередачиВАренду</types>
      <types>DocumentRef.ПеремещениеОС2_4</types>
      <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
      <types>DocumentRef.РазукомплектацияОС</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.ПогашениеСтоимостиТМЦВЭксплуатации</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.МодернизацияОС2_4</types>
      <types>DocumentRef.СписаниеНДСНаРасходы</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>DocumentRef.ПоступлениеТоваровОтХранителя</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПодготовкаКПередачеОС2_4</types>
      <types>DocumentRef.ИзменениеУсловийДоговораАренды</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.ИзменениеПараметровНМА</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваровПолученное</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ПереоценкаОС2_4</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.Сторно</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.АмортизацияОС</types>
      <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
      <types>DocumentRef.ПодготовкаКПередачеОС</types>
      <types>DocumentRef.ПересортицаТоваровУХранителя</types>
      <types>DocumentRef.ВводОстатковНДСПредъявленного</types>
      <types>DocumentRef.РасчетРезервовПодОбесценениеЗапасов</types>
      <types>DocumentRef.ПоступлениеАрендованныхОС</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
      <types>DocumentRef.ПереоценкаНМА</types>
      <types>DocumentRef.ПередачаСырьяПереработчику</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.КорректировкаНазначенияТоваров</types>
      <types>DocumentRef.ВыбытиеРНПТМатериаловИзПроизводства</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
      <types>DocumentRef.УлучшениеНМА</types>
      <types>DocumentRef.ВводОстатковРасходовПриУСН</types>
      <types>DocumentRef.ПерерасчетНДФЛ</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.НачислениеСписаниеРезервовПоСомнительнымДолгам</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.НачислениеДивидендов</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.ПереоценкаОС</types>
      <types>DocumentRef.ПеремещениеНМА2_4</types>
      <types>DocumentRef.АмортизацияНМА2_4</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АннулированиеПодарочныхСертификатов</types>
      <types>DocumentRef.АктПремииПоставщика</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.СписаниеНМА2_4</types>
      <types>DocumentRef.ВводОстатковУзловКомпонентовАмортизации</types>
      <types>DocumentRef.РаспределениеВозвратныхОтходов</types>
      <types>DocumentRef.ВводОстатковПоФинансовымИнструментам</types>
      <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
      <types>DocumentRef.ПринятиеКУчетуОС2_4</types>
      <types>DocumentRef.ИзменениеПараметровОС</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииОС</types>
      <types>DocumentRef.ОтчетОРозничныхВозвратах</types>
      <types>DocumentRef.ВозвратСырьяОтПереработчика</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ОприходованиеТМЦВЭксплуатации</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриемкаТоваровНаХранение</types>
      <types>DocumentRef.ОтчетОСписанииТоваровУХранителя</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.НачислениеПроцентовПоАренде</types>
      <types>DocumentRef.ИсправлениеРазвернутогоСальдоТоваровОрганизаций</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.АмортизацияОС2_4</types>
      <types>DocumentRef.ПринятиеКУчетуУзловКомпонентовАмортизации</types>
      <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
      <types>DocumentRef.ВводОстатковТоваров</types>
      <types>DocumentRef.ВыкупАрендованныхОС</types>
      <types>DocumentRef.ВводОстатковПрочиеРасходы</types>
      <types>DocumentRef.СчетФактураКомиссионеру</types>
      <types>DocumentRef.НачислениеСписаниеРезервовПредстоящихРасходов</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
      <types>DocumentRef.ВозвратОСИзАренды</types>
      <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
      <types>DocumentRef.СписаниеИзЭксплуатации</types>
      <types>DocumentRef.РегламентнаяОперация</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ДепонированиеЗарплаты</types>
      <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
      <types>DocumentRef.РасчетСебестоимостиТоваров</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.КорректировкаСтоимостиИАмортизацииНМА</types>
      <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
      <types>DocumentRef.ЗаписьКнигиПродаж</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.ОтчетПереработчика2_5</types>
      <types>DocumentRef.ПризнаниеРасходовПоИсследованиямИРазработкам</types>
      <types>DocumentRef.ВозвратПодарочныхСертификатов</types>
      <types>DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВыкупТоваровХранителем</types>
      <types>DocumentRef.КорректировкаВидаДеятельностиНДС</types>
      <types>DocumentRef.ПередачаОСВАренду2_4</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
      <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
      <types>DocumentRef.ВводОстатковРасчетовПоЭквайрингу</types>
      <types>DocumentRef.ПрекращениеДоговораАренды</types>
      <types>DocumentRef.СписаниеРасхожденийПоступлениеПриобретение</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваровУХранителя</types>
      <types>DocumentRef.ПринятиеКУчетуНМА</types>
      <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
      <types>DocumentRef.ВводОстатковСПодотчетниками</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
      <types>DocumentRef.СписаниеНМА</types>
      <types>DocumentRef.ВыбытиеАрендованныхОС</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
      <types>DocumentRef.ЗаключениеДоговораАренды</types>
      <types>DocumentRef.ВводОстатковИнвестицииВАренду</types>
      <types>DocumentRef.СчетФактураКомитента</types>
      <types>DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</types>
      <types>DocumentRef.РаспределениеНДС</types>
      <types>DocumentRef.ОтчетКомитентуОЗакупках</types>
      <types>DocumentRef.ВводОстатковПрочихАктивовПассивов</types>
      <types>DocumentRef.ПорчаТоваровУХранителя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/CommonModules/ОбщегоНазначенияУТСобытия/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
// 	Источник - ПланВидовХарактеристикОбъект, ДокументОбъект, СправочникОбъект -
// 	Отказ - Булево -
Процедура ИсключенияПоискаСсылокПередУдалением(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Реквизиты.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабличнаяЧасть.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.ВидыНоменклатуры.РеквизитыДляКонтроляНоменклатуры КАК ТабличнаяЧасть
		|	ГДЕ
		|		ТабличнаяЧасть.Свойство = &УдаляемоеСвойство
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧасть.Ссылка
		|	ИЗ
		|		Справочник.ВидыНоменклатуры.РеквизитыДляКонтроляХарактеристик КАК ТабличнаяЧасть
		|	ГДЕ
		|		ТабличнаяЧасть.Свойство = &УдаляемоеСвойство
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧасть.Ссылка
		|	ИЗ
		|		Справочник.ВидыНоменклатуры.РеквизитыДляКонтроляСерий КАК ТабличнаяЧасть
		|	ГДЕ
		|		ТабличнаяЧасть.Свойство = &УдаляемоеСвойство
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧасть.Ссылка
		|	ИЗ
		|		Справочник.ВидыНоменклатуры.РеквизитыБыстрогоОтбораНоменклатуры КАК ТабличнаяЧасть
		|	ГДЕ
		|		ТабличнаяЧасть.Свойство = &УдаляемоеСвойство
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧасть.Ссылка
		|	ИЗ
		|		Справочник.ВидыНоменклатуры.РеквизитыБыстрогоОтбораХарактеристик КАК ТабличнаяЧасть
		|	ГДЕ
		|		ТабличнаяЧасть.Свойство = &УдаляемоеСвойство) КАК Реквизиты";
		
		Запрос.УстановитьПараметр("УдаляемоеСвойство", Источник.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		НачатьТранзакцию();
			
		Попытка
			
			Пока Выборка.Следующий() Цикл
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыНоменклатуры");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
				
				Блокировка.Заблокировать();
				ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
				ОбъектССсылкой = Выборка.Ссылка.ПолучитьОбъект(); // СправочникОбъект.ВидыНоменклатуры - 
				
				УдалитьВхожденияЭлементаИзТабличнойЧасти(ОбъектССсылкой.РеквизитыДляКонтроляНоменклатуры,     Источник.Ссылка, "Свойство");
				УдалитьВхожденияЭлементаИзТабличнойЧасти(ОбъектССсылкой.РеквизитыДляКонтроляХарактеристик,    Источник.Ссылка, "Свойство");
				УдалитьВхожденияЭлементаИзТабличнойЧасти(ОбъектССсылкой.РеквизитыДляКонтроляСерий,            Источник.Ссылка, "Свойство");
				УдалитьВхожденияЭлементаИзТабличнойЧасти(ОбъектССсылкой.РеквизитыБыстрогоОтбораНоменклатуры,  Источник.Ссылка, "Свойство");
				УдалитьВхожденияЭлементаИзТабличнойЧасти(ОбъектССсылкой.РеквизитыБыстрогоОтбораХарактеристик, Источник.Ссылка, "Свойство");
				
				ОбъектССсылкой.Записать();
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			ВызватьИсключение ОписаниеОшибки;
			
		КонецПопытки;
	//++ НЕ УТ
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ИзменениеПараметровНМА2_4") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ИзменениеПараметровОС2_4")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.МодернизацияОС2_4")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПереоценкаНМА2_4")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПереоценкаОС2_4")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПринятиеКУчетуНМА2_4")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПринятиеКУчетуОС2_4")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПринятиеКУчетуУзловКомпонентовАмортизации")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.РазукомплектацияОС")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ОбъединениеОС")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СписаниеНМА2_4")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СписаниеОС2_4")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.УлучшениеНМА") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Источник.Ссылка);
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка
		|ИЗ
		|	&Таблица КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.ДокументВДругомУчете = &УдаляемыйОбъект";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Таблица", ИмяТаблицы);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("УдаляемыйОбъект", Источник.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		НачатьТранзакцию();
		Попытка
		
			Пока Выборка.Следующий() Цикл
			
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
				
				Блокировка.Заблокировать();
				ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
				
				ОбъектССсылкой = Выборка.Ссылка.ПолучитьОбъект(); // ДокументОбъект - 
				ОбъектССсылкой.ДокументВДругомУчете = Неопределено;
				ОбъектССсылкой.Записать();
			
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			ВызватьИсключение ОписаниеОшибки;
		КонецПопытки; 
		
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.СтатьиБюджетов") 
		ИЛИ ТипИсточника = Тип("СправочникОбъект.ПоказателиБюджетов") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПравилаПолученияФактаПоПоказателямБюджетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПравилаПолученияФактаПоПоказателямБюджетов КАК ПравилаПолученияФактаПоПоказателямБюджетов
		|ГДЕ
		|	ПравилаПолученияФактаПоПоказателямБюджетов.ПоказательБюджетов = &УдаляемыйОбъект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПравилаПолученияФактаПоСтатьямБюджетов.Ссылка
		|ИЗ
		|	Справочник.ПравилаПолученияФактаПоСтатьямБюджетов КАК ПравилаПолученияФактаПоСтатьямБюджетов
		|ГДЕ
		|	ПравилаПолученияФактаПоСтатьямБюджетов.СтатьяБюджетов = &УдаляемыйОбъект";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("УдаляемыйОбъект", Источник.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		НачатьТранзакцию();
		Попытка
		
			Пока Выборка.Следующий() Цикл
			
				Блокировка = Новый БлокировкаДанных;
				ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Выборка.Ссылка);
		
				ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
				
				Блокировка.Заблокировать();
				ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
				
				ОбъектССсылкой = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектССсылкой.Удалить();
			
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			ВызватьИсключение ОписаниеОшибки;
		КонецПопытки; 
		
	//-- НЕ УТ
	
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьОтветственногоВСправочникахОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	ОтветственныйВДокументах = ПолучитьФункциональнуюОпцию("ОтветственныйВДокументах");
	СтандартнаяСсылка 		 = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("aa00559e-ad84-4494-88fd-f0826edc46f0"));
	ТекущийПользователь		 = Пользователи.АвторизованныйПользователь();
	МетаданныеДокумента 	 = Источник.Метаданные();
	
	Если Не ОтветственныйВДокументах ИЛИ (СтандартнаяСсылка = ТекущийПользователь 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "Служебный")) Тогда
		
		Если Не Источник.ЭтоГруппа Тогда 
			Если МетаданныеДокумента.Реквизиты.Найти("Ответственный") <> Неопределено Тогда
				Источник.Ответственный = Неопределено;
			КонецЕсли;
			
			Если МетаданныеДокумента.Реквизиты.Найти("Менеджер") <> Неопределено Тогда
				Источник.Менеджер = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьОтветственногоВДокументахОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ОтветственныеЛицаСервер.ОчиститьОтветственногоВДокументе(Источник);
	
КонецПроцедуры

// Обработчик подписки на событие ЗарегистрироватьДанныеПервичныхДокументов
// 
// Параметры:
// 	Источник - ДокументОбъект -
// 	Отказ - Булево - 
Процедура ПриЗаписиДокументаРегистрацияДанныхПервичныхДокументов(Источник, Отказ) Экспорт
	Перем НомерДокумента, ДатаДокумента;
	 
	Если Источник.ОбменДанными.Загрузка = Истина
		И Источник.ДополнительныеСвойства.Свойство("РегистрироватьДанныеПервичныхДокументов")
		И Источник.ДополнительныеСвойства.РегистрироватьДанныеПервичныхДокументов = Ложь Тогда
		// Регистр ДанныеПервичныхДокументов по сути содержит в себе данные документа.
		// При обменах формирование регистра также необходимо выполнить. Без этого данные не будут корректными.
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ссылка = Источник.Ссылка;
	МетаданныеДокумента = Источник.Метаданные();
	
	ИменаРеквизитов = "Номер, Дата";
	
	ЭтоДокументИнтеркампани     = ОбщегоНазначения.ЕстьРеквизитОбъекта("РасчетыЧерезОтдельногоКонтрагента", МетаданныеДокумента);
	ЕстьНомерВходящегоДокумента = ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерВходящегоДокумента", МетаданныеДокумента);
	ЕстьПредставлениеНомера     = ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеНомера", МетаданныеДокумента);
	ЕстьДатаВходящегоДокумента  = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаВходящегоДокумента", МетаданныеДокумента); 
	ЕстьРеквизитИсправление     = ОбщегоНазначения.ЕстьРеквизитОбъекта("Исправление", МетаданныеДокумента);
	
	ЕстьРеквизитХозяйственнаяОперация = ОбщегоНазначения.ЕстьРеквизитОбъекта("ХозяйственнаяОперация", МетаданныеДокумента); 
	ЕстьРеквизитОснованиеДата         = ОбщегоНазначения.ЕстьРеквизитОбъекта("ОснованиеДата", МетаданныеДокумента); 
	ЕстьРеквизитОснованиеНомер        = ОбщегоНазначения.ЕстьРеквизитОбъекта("ОснованиеНомер", МетаданныеДокумента); 
	
	Если ?(ЭтоДокументИнтеркампани, Источник["РасчетыЧерезОтдельногоКонтрагента"], Истина) 
		 И ЕстьНомерВходящегоДокумента Тогда
		 
		ИменаРеквизитов = ИменаРеквизитов + ", НомерВходящегоДокумента";
		Если ЕстьДатаВходящегоДокумента Тогда
			ИменаРеквизитов = ИменаРеквизитов + ", ДатаВходящегоДокумента";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьПредставлениеНомера Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", ПредставлениеНомера";
	КонецЕсли;
	
	Реквизиты = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Реквизиты, Источник);
	
	// Установка управляемой блокировки.
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ДанныеПервичныхДокументов");
	ЭлементБлокировки.УстановитьЗначение("Документ", Ссылка);
	БлокировкаДанных.Заблокировать();
	
	НомерДокумента	= "";
	ДатаДокумента	= '00010101';
	
	Если ЕстьРеквизитХозяйственнаяОперация
		И КомиссионнаяТорговляСервер.РеализацияЧерезКомиссионера(Источник.ХозяйственнаяОперация)
		И ЕстьРеквизитОснованиеНомер И ЗначениеЗаполнено(Источник.ОснованиеНомер)
		И ЕстьРеквизитОснованиеДата И ЗначениеЗаполнено(Источник.ОснованиеДата) Тогда
		НомерДокумента = Источник.ОснованиеНомер;
		ДатаДокумента  = Источник.ОснованиеДата;
	ИначеЕсли Реквизиты.Свойство("НомерВходящегоДокумента") Тогда
		НомерДокумента	= СокрЛП(Реквизиты.НомерВходящегоДокумента);
		Если Реквизиты.Свойство("ДатаВходящегоДокумента") Тогда
			ДатаДокумента = Реквизиты.ДатаВходящегоДокумента;
		КонецЕсли;
	ИначеЕсли Реквизиты.Свойство("ПредставлениеНомера") Тогда
		НомерДокумента	= СокрЛП(Реквизиты.ПредставлениеНомера);
		ДатаДокумента	= Реквизиты.Дата;
	Иначе
		НомерДокумента	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Ложь, Истина);
		ДатаДокумента	= Реквизиты.Дата;
	КонецЕсли;
	
	ОрганизацииКРегистрации = Новый Соответствие();
	ДополнитьОрганизацииКРегистрации(Источник, МетаданныеДокумента, ОрганизацииКРегистрации);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СторнируемыйДокумент", МетаданныеДокумента) 
		И ЗначениеЗаполнено(Источник["СторнируемыйДокумент"]) Тогда
		СторнируемыйДокументОбъект = Источник["СторнируемыйДокумент"].ПолучитьОбъект();
		ДополнитьОрганизацииКРегистрации(СторнируемыйДокументОбъект, СторнируемыйДокументОбъект.Метаданные(), ОрганизацииКРегистрации);
	КонецЕсли;
	
	НаборЗаписейРегистра = РегистрыСведений.ДанныеПервичныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.Документ.Установить(Ссылка);
	
	Для каждого КлючИЗначение Из ОрганизацииКРегистрации Цикл
		
		Организация = КлючИЗначение.Ключ;
		ИмяРеквизита = КлючИЗначение.Значение;
		
		НоваяЗапись = НаборЗаписейРегистра.Добавить();
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.Документ    = Ссылка;
		
		Если ЭтоДокументИнтеркампани И ИмяРеквизита = "Организация" Тогда
			НоваяЗапись.Номер    = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина, Истина);
			НоваяЗапись.Дата     = Реквизиты.Дата;
		Иначе
			НоваяЗапись.Номер    = НомерДокумента;
			НоваяЗапись.Дата     = ДатаДокумента;
		КонецЕсли;
		
		НоваяЗапись.НомерРегистратора = Реквизиты.Номер;
		НоваяЗапись.ДатаРегистратора = Реквизиты.Дата;
		
	КонецЦикла;
	
	НаборЗаписейРегистра.Записать(Истина);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Обработчик подписки на событие ПроверитьЗначениеОпцииИспользоватьНесколькоОрганизаций.
// Вызывается при записи элемента справочника "Организации".
//
Процедура ПроверитьЗначениеОпцииИспользоватьНесколькоОрганизацийПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.ЭтоГруппа
	 И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций")
	 И Справочники.Организации.КоличествоОрганизаций() > 1 Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Константы.ИспользоватьНесколькоОрганизаций.Установить(Истина);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьВхожденияЭлементаИзТабличнойЧасти(ТабличнаяЧасть, Ссылка, Колонка)
	
	Отбор = Новый Структура(Колонка, Ссылка);
	
	Строки = ТабличнаяЧасть.НайтиСтроки(Отбор);
	Для Каждого ТекСтр Из Строки Цикл
		ТабличнаяЧасть.Удалить(ТекСтр);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьОрганизацииКРегистрации(Источник, МетаданныеДокумента, ОрганизацииКРегистрации)
	
	// Дополним МассивОрганизаций организациями из шапки документа
	МассивРеквизитовОрганизация = ИменаРеквизитовОрганизаций(МетаданныеДокумента);
	Для каждого РеквизитОрганизация Из МассивРеквизитовОрганизация Цикл
		ДобавитьОрганизацию(ОрганизацииКРегистрации, Источник, РеквизитОрганизация);
	КонецЦикла;
	
	// Дополним МассивОрганизаций организациями из табличных частей
	Для каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		МассивРеквизитовОрганизация = ИменаРеквизитовОрганизаций(ТабличнаяЧасть);
		Если МассивРеквизитовОрганизация.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Строка Из Источник[ТабличнаяЧасть.Имя] Цикл
			Для каждого РеквизитОрганизация Из МассивРеквизитовОрганизация Цикл
				ДобавитьОрганизацию(ОрганизацииКРегистрации, Строка, РеквизитОрганизация);
			КонецЦикла;
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОрганизацию(ОрганизацииКРегистрации, Данные, ИмяРеквизита)
	
	ЗначениеРеквизита = Данные[ИмяРеквизита];
	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) 
		И ТипЗнч(ЗначениеРеквизита) = Тип("СправочникСсылка.Организации") Тогда
		
		ОрганизацииКРегистрации.Вставить(ЗначениеРеквизита, ИмяРеквизита);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИменаРеквизитовОрганизаций(ОбъектМетаданных)
	
	ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	
	Возврат ОрганизацииПовтИсп.ИменаРеквизитовОрганизаций(ПолноеИмя);

КонецФункции

#КонецОбласти
